Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129ENCZAD.svd
        <register>
          <name>HB8CFG2</name>
          <description>EPI Host-Bus 8 Configuration 2</description>
          <alternateGroup>EPI_ALT8</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_HB8CFG2_MODE</name>
              <description>CS1n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_MODE_ADMUX</name>
                  <description>ADMUX - AD[7:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_MODE_AD</name>
                  <description>ADNONMUX - D[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_ALEHIGH</name>
              <description>CS1n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB8CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate and Multiple Sub-Mode Configuration enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_HB8CFG2_CSCFGEXT</name>
              <description>Chip Select Extended Configuration</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HB16CFG2</name>
          <description>EPI Host-Bus 16 Configuration 2</description>
          <alternateGroup>EPI_ALT16</alternateGroup>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>EPI_HB16CFG2_MODE</name>
              <description>CS1n Host Bus Sub-Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_MODE_ADMUX</name>
                  <description>ADMUX - AD[15:0]</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_MODE_AD</name>
                  <description>ADNONMUX - D[15:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDWS</name>
              <description>CS1n Read Wait States</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_2</name>
                  <description>Active RDn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_4</name>
                  <description>Active RDn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_6</name>
                  <description>Active RDn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_RDWS_8</name>
                  <description>Active RDn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRWS</name>
              <description>CS1n Write Wait States</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_2</name>
                  <description>Active WRn is 2 EPI clocks</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_4</name>
                  <description>Active WRn is 4 EPI clocks</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_6</name>
                  <description>Active WRn is 6 EPI clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_WRWS_8</name>
                  <description>Active WRn is 8 EPI clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_BURST</name>
              <description>CS1n Burst Mode</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDCRE</name>
              <description>CS1n PSRAM Configuration Register Read</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRCRE</name>
              <description>CS1n PSRAM Configuration Register Write</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_ALEHIGH</name>
              <description>CS1n ALE Strobe Polarity</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_RDHIGH</name>
              <description>CS1n READ Strobe Polarity</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_WRHIGH</name>
              <description>CS1n WRITE Strobe Polarity</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSCFG</name>
              <description>Chip Select Configuration</description>
              <bitRange>[25:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ALE</name>
                  <description>ALE Configuration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_CS</name>
                  <description>CSn Configuration</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_DCS</name>
                  <description>Dual CSn Configuration</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_HB16CFG2_CSCFG_ADCS</name>
                  <description>ALE with Dual CSn Configuration</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSBAUD</name>
              <description>Chip Select Baud Rate and Multiple Sub-Mode Configuration enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>EPI_HB16CFG2_CSCFGEXT</name>
              <description>Chip Select Extended Configuration</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRMAP</name>
          <description>EPI Address Map</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>EPI_ADDRMAP_ERADR</name>
              <description>External RAM Address</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_6000</name>
                  <description>At 0x6000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_8000</name>
                  <description>At 0x8000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERADR_HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS0n maps to 0x6000.0000 and CS1n maps to 0x8000.0000</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ERSZ</name>
              <description>External RAM Size</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ERSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPADR</name>
              <description>External Peripheral Address</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_A000</name>
                  <description>At 0xA000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_C000</name>
                  <description>At 0xC000.0000</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPADR_HBQS</name>
                  <description>Only to be used with Host Bus quad chip select. In quad chip select mode, CS2n maps to 0xA000.0000 and CS3n maps to 0xC000.0000</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_EPSZ</name>
              <description>External Peripheral Size</description>
              <bitRange>[7:6]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_EPSZ_256MB</name>
                  <description>256 MB; lower address range: 0x000.0000 to 0xFFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ECADR</name>
              <description>External Code Address</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECADR_NONE</name>
                  <description>Not mapped</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECADR_1000</name>
                  <description>At 0x1000.0000</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EPI_ADDRMAP_ECSZ</name>
              <description>External Code Size</description>
              <bitRange>[11:10]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_256B</name>
                  <description>256 bytes; lower address range: 0x00 to 0xFF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_64KB</name>
                  <description>64 KB; lower address range: 0x0000 to 0xFFFF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_16MB</name>
                  <description>16 MB; lower address range: 0x00.0000 to 0xFF.FFFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_ADDRMAP_ECSZ_256MB</name>
                  <description>256MB; lower address range: 0x000.0000 to 0x0FFF.FFFF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE0</name>
          <description>EPI Read Size 0</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE0_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE0_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR0</name>
          <description>EPI Read Address 0</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR0_ADDR</name>
              <description>Current Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD0</name>
          <description>EPI Non-Blocking Read Data 0</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD0_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RSIZE1</name>
          <description>EPI Read Size 1</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>EPI_RSIZE1_SIZE</name>
              <description>Current Size</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_8BIT</name>
                  <description>Byte (8 bits)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_16BIT</name>
                  <description>Half-word (16 bits)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EPI_RSIZE1_SIZE_32BIT</name>
                  <description>Word (32 bits)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RADDR1</name>
          <description>EPI Read Address 1</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>EPI_RADDR1_ADDR</name>
              <description>Current Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RPSTD1</name>
          <description>EPI Non-Blocking Read Data 1</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>EPI_RPSTD1_POSTCNT</name>
              <description>Post Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
