Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129ENCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HIB</name>
      <description>Register map for HIB peripheral</description>
      <groupName>HIB</groupName>
      <prependToName>HIB</prependToName>
      <baseAddress>0x400FC000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>HIB</name><value>41</value></interrupt>
      <registers>
        <register>
          <name>RTCC</name>
          <description>Hibernation RTC Counter</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCC</name>
              <description>RTC Counter</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCM0</name>
          <description>Hibernation RTC Match 0</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCM0</name>
              <description>RTC Match 0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCLD</name>
          <description>Hibernation RTC Load</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCLD</name>
              <description>RTC Load</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>Hibernation Control</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>HIB_CTL_RTCEN</name>
              <description>RTC Timer Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_HIBREQ</name>
              <description>Hibernation Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_RTCWEN</name>
              <description>RTC Wake-up Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_PINWEN</name>
              <description>External Wake Pin Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_CLK32EN</name>
              <description>Clocking Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VABORT</name>
              <description>Power Cut Abort Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VDD3ON</name>
              <description>VDD Powered</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_BATWKEN</name>
              <description>Wake on Low Battery</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_BATCHK</name>
              <description>Check Battery Status</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_VBATSEL</name>
              <description>Select for Low-Battery Comparator</description>
              <bitRange>[14:13]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_1_9V</name>
                  <description>1.9 Volts</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_1V</name>
                  <description>2.1 Volts (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_3V</name>
                  <description>2.3 Volts</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_CTL_VBATSEL_2_5V</name>
                  <description>2.5 Volts</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIB_CTL_OSCBYP</name>
              <description>Oscillator Bypass</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_OSCDRV</name>
              <description>Oscillator Drive Capability</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_OSCSEL</name>
              <description>Oscillator Select</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_RETCLR</name>
              <description>GPIO Retention/Clear</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>HIB_CTL_WRC</name>
              <description>Write Complete/Capable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IM</name>
          <description>Hibernation Interrupt Mask</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>HIB_IM_RTCALT0</name>
              <description>RTC Alert 0 Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IM_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IM_EXTW</name>
              <description>External Wake-Up Interrupt Mask</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_IM_WC</name>
              <description>External Write Complete/Capable Interrupt Mask</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_IM_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HIB_IM_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_IM_VDDFAIL</name>
              <description>VDD Fail Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RIS</name>
          <description>Hibernation Raw Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>HIB_RIS_RTCALT0</name>
              <description>RTC Alert 0 Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_LOWBAT</name>
              <description>Low Battery Voltage Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_EXTW</name>
              <description>External Wake-Up Raw Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_WC</name>
              <description>Write Complete/Capable Raw Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_PADIOWK</name>
              <description>Pad I/O Wake-Up Raw Interrupt Status</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Raw Interrupt Status</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_RIS_VDDFAIL</name>
              <description>VDD Fail Raw Interrupt Status</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIS</name>
          <description>Hibernation Masked Interrupt Status</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>HIB_MIS_RTCALT0</name>
              <description>RTC Alert 0 Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_LOWBAT</name>
              <description>Low Battery Voltage Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_EXTW</name>
              <description>External Wake-Up Masked Interrupt Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_WC</name>
              <description>Write Complete/Capable Masked Interrupt Status</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Mask</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Mask</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_MIS_VDDFAIL</name>
              <description>VDD Fail Interrupt Mask</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IC</name>
          <description>Hibernation Interrupt Clear</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>HIB_IC_RTCALT0</name>
              <description>RTC Alert0 Masked Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IC_LOWBAT</name>
              <description>Low Battery Voltage Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HIB_IC_EXTW</name>
              <description>External Wake-Up Interrupt Clear</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HIB_IC_WC</name>
              <description>Write Complete/Capable Interrupt Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_IC_PADIOWK</name>
              <description>Pad I/O Wake-Up Interrupt Clear</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HIB_IC_RSTWK</name>
              <description>Reset Pad I/O Wake-Up Interrupt Clear</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HIB_IC_VDDFAIL</name>
              <description>VDD Fail Interrupt Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCT</name>
          <description>Hibernation RTC Trim</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCT_TRIM</name>
              <description>RTC Trim Value</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCSS</name>
          <description>Hibernation RTC Sub Seconds</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>HIB_RTCSS_RTCSSC</name>
              <description>RTC Sub Seconds Count</description>
              <bitRange>[14:0]</bitRange>
            </field>
            <field>
              <name>HIB_RTCSS_RTCSSM</name>
              <description>RTC Sub Seconds Match</description>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IO</name>
          <description>Hibernation IO Configuration</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>HIB_IO_WUUNLK</name>
              <description>I/O Wake Pad Configuration Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_IO_WURSTEN</name>
              <description>Reset Wake Source Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_IO_IOWRC</name>
              <description>I/O Write Complete</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Hibernation Data</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>HIB_DATA_RTD</name>
              <description>Hibernation Module NV Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALCTL</name>
          <description>Hibernation Calendar Control</description>
          <addressOffset>0x00000300</addressOffset>
          <fields>
            <field>
              <name>HIB_CALCTL_CALEN</name>
              <description>RTC Calendar/Counter Mode Select</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_CALCTL_CAL24</name>
              <description>Calendar Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL0</name>
          <description>Hibernation Calendar 0</description>
          <addressOffset>0x00000310</addressOffset>
          <fields>
            <field>
              <name>HIB_CAL0_SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>HIB_CAL0_MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>HIB_CAL0_HR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>HIB_CAL0_AMPM</name>
              <description>AM/PM Designation</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>HIB_CAL0_VALID</name>
              <description>Valid Calendar Load</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL1</name>
          <description>Hibernation Calendar 1</description>
          <addressOffset>0x00000314</addressOffset>
          <fields>
            <field>
              <name>HIB_CAL1_DOM</name>
              <description>Day of Month</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>HIB_CAL1_MON</name>
              <description>Month</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>HIB_CAL1_YEAR</name>
              <description>Year Value</description>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>HIB_CAL1_DOW</name>
              <description>Day of Week</description>
              <bitRange>[26:24]</bitRange>
            </field>
            <field>
              <name>HIB_CAL1_VALID</name>
              <description>Valid Calendar Load</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALLD0</name>
          <description>Hibernation Calendar Load 0</description>
          <addressOffset>0x00000320</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>HIB_CALLD0_SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_HR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD0_AMPM</name>
              <description>AM/PM Designation</description>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALLD1</name>
          <description>Hibernation Calendar Load</description>
          <addressOffset>0x00000324</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>HIB_CALLD1_DOM</name>
              <description>Day of Month</description>
              <bitRange>[4:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_MON</name>
              <description>Month</description>
              <bitRange>[11:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_YEAR</name>
              <description>Year Value</description>
              <bitRange>[22:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HIB_CALLD1_DOW</name>
              <description>Day of Week</description>
              <bitRange>[26:24]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALM0</name>
          <description>Hibernation Calendar Match 0</description>
          <addressOffset>0x00000330</addressOffset>
          <fields>
            <field>
              <name>HIB_CALM0_SEC</name>
              <description>Seconds</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>HIB_CALM0_MIN</name>
              <description>Minutes</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>HIB_CALM0_HR</name>
              <description>Hours</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>HIB_CALM0_AMPM</name>
              <description>AM/PM Designation</description>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALM1</name>
          <description>Hibernation Calendar Match 1</description>
          <addressOffset>0x00000334</addressOffset>
          <fields>
            <field>
              <name>HIB_CALM1_DOM</name>
              <description>Day of Month</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>Hibernation Lock</description>
          <addressOffset>0x00000360</addressOffset>
          <fields>
            <field>
              <name>HIB_LOCK_HIBLOCK</name>
              <description>HIbernate Lock</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPCTL</name>
          <description>HIB Tamper Control</description>
          <addressOffset>0x00000400</addressOffset>
          <fields>
            <field>
              <name>HIB_TPCTL_TPEN</name>
              <description>Tamper Module Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HIB_TPCTL_TPCLR</name>
              <description>Tamper Event Clear</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HIB_TPCTL_MEMCLR</name>
              <description>HIB Memory Clear on Tamper Event</description>
              <bitRange>[9:8]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_NONE</name>
                  <description>Do not Clear HIB memory on tamper event</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_LOW32</name>
                  <description>Clear Lower 32 Bytes of HIB memory on tamper event</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_HIGH32</name>
                  <description>Clear upper 32 Bytes of HIB memory on tamper event</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIB_TPCTL_MEMCLR_ALL</name>
                  <description>Clear all HIB memory on tamper event</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HIB_TPCTL_WAKE</name>
              <description>Wake from Hibernate on a Tamper Event</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
