Roland665/MiniCar_Guet/MiniCar_V2/.pack/Keil/TM4C_DFP.1.1.0/SVD/TM4C129/TM4C129ENCZAD.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SHAMD5</name>
      <description>Register map for SHAMD5 peripheral</description>
      <groupName>SHAMD5</groupName>
      <prependToName>SHAMD5</prependToName>
      <baseAddress>0x44034000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00002000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ODIGEST_A</name>
          <description>SHA Outer Digest A</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_A_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_B</name>
          <description>SHA Outer Digest B</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_B_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_C</name>
          <description>SHA Outer Digest C</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_C_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_D</name>
          <description>SHA Outer Digest D</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_D_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_E</name>
          <description>SHA Outer Digest E</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_E_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_F</name>
          <description>SHA Outer Digest F</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_F_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_G</name>
          <description>SHA Outer Digest G</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_G_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ODIGEST_H</name>
          <description>SHA Outer Digest H</description>
          <addressOffset>0x0000001C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_ODIGEST_H_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_A</name>
          <description>SHA Inner Digest A</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_A_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_B</name>
          <description>SHA Inner Digest B</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_B_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_C</name>
          <description>SHA Inner Digest C</description>
          <addressOffset>0x00000028</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_C_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_D</name>
          <description>SHA Inner Digest D</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_D_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_E</name>
          <description>SHA Inner Digest E</description>
          <addressOffset>0x00000030</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_E_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_F</name>
          <description>SHA Inner Digest F</description>
          <addressOffset>0x00000034</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_F_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_G</name>
          <description>SHA Inner Digest G</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_G_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIGEST_H</name>
          <description>SHA Inner Digest H</description>
          <addressOffset>0x0000003C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IDIGEST_H_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGEST_COUNT</name>
          <description>SHA Digest Count</description>
          <addressOffset>0x00000040</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DIGEST_COUNT</name>
              <description>Digest Count</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>SHA Mode</description>
          <addressOffset>0x00000044</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_MODE_ALGO</name>
              <description>Hash Algorithm</description>
              <bitRange>[2:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAMD5_MODE_ALGO_MD5</name>
                  <description>MD5</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAMD5_MODE_ALGO_SHA1</name>
                  <description>SHA-1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAMD5_MODE_ALGO_SHA224</name>
                  <description>SHA-224</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHAMD5_MODE_ALGO_SHA256</name>
                  <description>SHA-256</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAMD5_MODE_ALGO_CONSTANT</name>
              <description>The initial digest register will be overwritten with the algorithm constants for the selected algorithm when hashing and the initial digest count register will be reset to 0</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SHAMD5_MODE_CLOSE_HASH</name>
              <description>Performs the padding, the Hash/HMAC will be 'closed' at the end of the block, as per MD5/SHA-1/SHA-2 specification</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SHAMD5_MODE_HMAC_KEY_PROC</name>
              <description>HMAC Key Processing Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SHAMD5_MODE_HMAC_OUTER_HASH</name>
              <description>HMAC Outer Hash Processing Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LENGTH</name>
          <description>SHA Length</description>
          <addressOffset>0x00000048</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_LENGTH</name>
              <description>Block Length/Remaining Byte Count</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_0_IN</name>
          <description>SHA Data 0 Input</description>
          <addressOffset>0x00000080</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_0_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_1_IN</name>
          <description>SHA Data 1 Input</description>
          <addressOffset>0x00000084</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_1_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_2_IN</name>
          <description>SHA Data 2 Input</description>
          <addressOffset>0x00000088</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_2_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_3_IN</name>
          <description>SHA Data 3 Input</description>
          <addressOffset>0x0000008C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_3_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_4_IN</name>
          <description>SHA Data 4 Input</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_4_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_5_IN</name>
          <description>SHA Data 5 Input</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_5_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_6_IN</name>
          <description>SHA Data 6 Input</description>
          <addressOffset>0x00000098</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_6_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_7_IN</name>
          <description>SHA Data 7 Input</description>
          <addressOffset>0x0000009C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_7_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_8_IN</name>
          <description>SHA Data 8 Input</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_8_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_9_IN</name>
          <description>SHA Data 9 Input</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_9_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_10_IN</name>
          <description>SHA Data 10 Input</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_10_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_11_IN</name>
          <description>SHA Data 11 Input</description>
          <addressOffset>0x000000AC</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_11_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_12_IN</name>
          <description>SHA Data 12 Input</description>
          <addressOffset>0x000000B0</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_12_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_13_IN</name>
          <description>SHA Data 13 Input</description>
          <addressOffset>0x000000B4</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_13_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_14_IN</name>
          <description>SHA Data 14 Input</description>
          <addressOffset>0x000000B8</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_14_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_15_IN</name>
          <description>SHA Data 15 Input</description>
          <addressOffset>0x000000BC</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_DATA_15_IN_DATA</name>
              <description>Digest/Key Data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REVISION</name>
          <description>SHA Revision</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_REVISION</name>
              <description>Revision Number</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCONFIG</name>
          <description>SHA System Configuration</description>
          <addressOffset>0x00000110</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_SYSCONFIG_SOFTRESET</name>
              <description>Soft reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SHAMD5_SYSCONFIG_IT_EN</name>
              <description>Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SHAMD5_SYSCONFIG_DMA_EN</name>
              <description>uDMA Request Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SHAMD5_SYSCONFIG_SIDLE</name>
              <description>Sidle mode</description>
              <bitRange>[5:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHAMD5_SYSCONFIG_SIDLE_FORCE</name>
                  <description>Force-idle mode</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAMD5_SYSCONFIG_SADVANCED</name>
              <description>Advanced Mode Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSSTATUS</name>
          <description>SHA System Status</description>
          <addressOffset>0x00000114</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_SYSSTATUS_RESETDONE</name>
              <description>Reset done status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQSTATUS</name>
          <description>SHA Interrupt Status</description>
          <addressOffset>0x00000118</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IRQSTATUS_OUTPUT_READY</name>
              <description>Output Ready Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SHAMD5_IRQSTATUS_INPUT_READY</name>
              <description>Input Ready Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SHAMD5_IRQSTATUS_CONTEXT_READY</name>
              <description>Context Ready Status</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQENABLE</name>
          <description>SHA Interrupt Enable</description>
          <addressOffset>0x0000011C</addressOffset>
          <fields>
            <field>
              <name>SHAMD5_IRQENABLE_OUTPUT_READY</name>
              <description>Mask for output ready interrupt</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SHAMD5_IRQENABLE_INPUT_READY</name>
              <description>Mask for input ready interrupt</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SHAMD5_IRQENABLE_CONTEXT_READY</name>
              <description>Mask for context ready interrupt</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
